import { IData, IHeading } from "@/components/Table/types";

const tableData: IData[] = [
  {
    name: "Исаев Елисей Андреевич",
    department: "Бухгалтерия",
    state: "Старший бухгалтер",
  },
  {
    name: "Акимова София Ильинична",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Самойлов Владимир Михайлович",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Шульгин Илья Артёмович",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Казаков Владимир Матвеевич",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Панова Екатерина Артёмовна",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Кузнецов Максим Андреевич",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Черепанова Анна Даниэльевна",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Тихомиров Герман Родионович",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Поляков Юрий Дмитриевич",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Захаров Александр Елисеевич",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Елисеева Анастасия Юрьевна",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Громова Валерия Платоновна",
    department: "Бухгалтерия",
    state: "Бухгалтер",
  },
  {
    name: "Куприянов Тимофей Арсентьевич",
    department: "Бухгалтерия",
    state: "Помощник бухгалтера",
  },
  {
    name: "Шувалов Захар Русланович",
    department: "Бухгалтерия",
    state: "Помощник бухгалтера",
  },
  {
    name: "Андреев Даниил Сергеевич",
    department: "Бухгалтерия",
    state: "Помощник бухгалтера",
  },
  {
    name: "Федотов Владимир Михайлович",
    department: "Бухгалтерия",
    state: "Помощник бухгалтера",
  },
  {
    name: "Ситникова Мария Ивановна",
    department: "Отдел внедрения",
    state: "Инженер",
  },
  {
    name: "Иванова Кристина Максимовна",
    department: "Отдел внедрения",
    state: "Кризис-менеджер",
  },
  {
    name: "Иванов Николай Григорьевич",
    department: "Отдел внедрения",
    state: "Сталевар",
  },
  {
    name: "Блинов Матвей Вадимович",
    department: "Отдел внедрения",
    state: "Диетолог",
  },
  {
    name: "Ушакова Екатерина Максимовна",
    department: "Отдел внедрения",
    state: "Эколог",
  },
  {
    name: "Алексеева Алиса Андреевна",
    department: "Отдел внедрения",
    state: "Ремонтник",
  },
  {
    name: "Титов Денис Маркович",
    department: "Юридический отдел",
    state: "Облицовщик",
  },
  {
    name: "Горбунова Ксения Григорьевна",
    department: "Юридический отдел",
    state: "Издатель",
  },
  {
    name: "Назаров Даниил Матвеевич",
    department: "Юридический отдел",
    state: "Венеролог",
  },
  {
    name: "Третьяков Адам Георгиевич",
    department: "Юридический отдел",
    state: "Психотерапевт",
  },
  {
    name: "Федоров Иван Артёмович",
    department: "Юридический отдел",
    state: "Микробиолог",
  },
  {
    name: "Колесникова Марина Никитична",
    department: "Юридический отдел",
    state: "Брокер",
  },
  {
    name: "Куликов Константин Максимович",
    department: "Юридический отдел",
    state: "Оториноларинголог (ЛОР)",
  },
  {
    name: "Кудрявцева Елизавета Константиновна",
    department: "Одтел продаж",
    state: "Священнослужитель",
  },
  {
    name: "Андрианов Даниил Фёдорович",
    department: "Одтел продаж",
    state: "Нефролог",
  },
  {
    name: "Рудаков Тимур Александрович",
    department: "Одтел продаж",
    state: "Ювелир",
  },
  {
    name: "Львов Кирилл Александрович",
    department: "Одтел продаж",
    state: "Кинорежиссер",
  },
  {
    name: "Наумова Анна Данииловна",
    department: "Одтел продаж",
    state: "Делопроизводитель",
  },
  {
    name: "Колпакова Вероника Александровна",
    department: "Отдел продаж",
    state: "Консультант телефона доверия",
  },
  {
    name: "Кожевников Андрей Александрович",
    department: "Одтел продаж",
    state: "Водолаз",
  },
  {
    name: "Богданов Артём Максимович",
    department: "Одтел продаж",
    state: "Шеф-повар",
  },
  {
    name: "Федоров Иван Андреевич",
    department: "Одтел продаж",
    state: "Гинеколог",
  },
  {
    name: "Вишневский Семён Егорович",
    department: "Одтел продаж",
    state: "Воздухоплаватель",
  },
  {
    name: "Романов Николай Артёмович",
    department: "Одтел продаж",
    state: "Официант",
  },
  {
    name: "Кузьмина Варвара Дмитриевна",
    department: "Одтел продаж",
    state: "Фотограф",
  },
  {
    name: "Никифорова Таисия Данииловна",
    department: "Одтел продаж",
    state: "Имиджмейкер",
  },
  {
    name: "Лукина Ева Александровна",
    department: "Одтел продаж",
    state: "Строитель",
  },
  {
    name: "Панфилова Полина Константиновна",
    department: "Одтел продаж",
    state: "Художник по костюму",
  },
];

const tableHeadings: IHeading[] = [
  { name: "name", label: "Фио" },
  { name: "department", label: "Отдел" },
  { name: "state", label: "Должность" },
];

export default {
  tableData,
  tableHeadings,
};
